[
["What's your most magnetic feature and why do you think so?",
"When do you feel the sexiest — clothes, mood, setting?",
"What's a flirt move that always works on you?",
"What's a compliment you've wanted to hear from a partner?",
"Have you ever felt an instant spark? Tell the short moment",
"What's one boundary you always want respected in flirtation?",
"What's a subtle sign you use to show attraction?",
"Describe an ideal slow, intimate evening without explicit detail",
"What's the wildest party moment you still laugh about?",
"Have you ever hooked up with someone at a party? Tell the short version"],[
"What's the boldest thing you've done for fun on a night out?",
"Who in this room would you pick for a dare and why?",
"What's a secret you kept during college/college-like years?",
"Have you ever lied about relationship status to avoid drama? Explain briefly",
"Which ex would you still consider meeting for coffee and why?",
"What's one wild bucket-list thing you haven't told anyone?",
"What's the most flirtatious thing you've ever done?",
"Name a secret crush you never told anyone about",
"Describe a steamy dream without graphic details",
"What's a naughty text you once sent (summarize — no explicit words)?"],[
"Have you ever flirted with someone to get what you wanted? What happened?",
"What's an outfit you know is irresistible on you?",
"Ever been caught in a flirty situation? Tell the story",
"What's a line that always gets your attention?",
"What's the cheesiest pickup line you've ever used?",
"When did you last write a love note and what did it say (one line)?",
"Who gave you butterflies the most and why?",
"Describe your perfect date in one sentence",
"Have you ever pretended to like something just to impress someone? What was it?",
"Which movie romance made you actually melt?"],[
"What's the most romantic thing you've secretly wished someone would do?",
"What's one silly romantic habit you have?",
"What's the most spontaneous romantic thing you've ever done?",
"Have you ever been in love at first sight? Tell the short version",
"What's a tiny gesture from someone that melts you instantly?",
"What's the funniest or worst date you've been on?",
"What's the most romantic gift you've ever given or received?",
"What's a song that puts you in a flirty mood and why?",
"What's one thing you wish a partner would do more often?",
"What's your go-to move to make someone smile?"]
]